 <HTML>
<HEAD>
<TITLE> Bibliographie mathematique</TITLE>
</HEAD>
<BODY bgcolor="#ffffff">
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A>Retour
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
<br>
<a href="../../../www.enst-bretagne.fr/default.htm"><IMG SRC="../Images/ABlogo.gif" border=0></a>
<CENTER>
<H3>
Mes lectures math&eacute;matiques pr&eacute;f&eacute;r&eacute;es.
</H3>
<H4>
Derni&egrave;re mise &agrave; jour: 22 avril 1998.
</H4>
</CENTER>
<H4> 
Si si, il existe de tr&egrave;s bons bouquins de maths, agr&eacute;ables
&agrave; lire qui vulgarisent bien le domaine. Voici ceux que je
pr&eacute;f&egrave;re et auxquels je me ref&egrave;re souvent.
</H4>
<P>
Commencons par les ouvrages d'int&eacute;ret g&eacute;n&eacute;ral d'histoire
ou de philosophie des math&eacute;matiques ou de vulgarisation.
<UL>
<LI>Jean Dieudonn&eacute; "Pour l'honneur de l'esprit humain", Hachette 1987
<BLOCKQUOTE>
<I>
L'histoire des math&eacute;matiques d&eacute;taill&eacute;e par le grand
mah&eacute;maticien contemporain Dieudonn&eacute;. Tr&egrave;s int&eacute;ressant,
les annexes sont parfois difficiles pour le non math&eacute;maticien
</I>
</BLOCKQUOTE>
<LI>Sous la direction de Francois Le Lionnais "Les grands courants de la pens&eacute;e
math&eacute;matique" cahier du sud 1986 (1948)
<BLOCKQUOTE>
<I>
Une r&eacute;&eacute;dition tr&egrave;s intelligente de l'ouvrage que Le Lionnais
avait pr&eacute;par&eacute; avant guerre et rassemblant des articles des
meilleurs math&eacute;maticiens de l'&eacute;poque couvrant toutes leurs
disciplines. On y trouvera des articles intitul&eacute;s "La beaut&eacute; en
math&eacute;matique" ou bien "La th&eacute;orie des groupes et l'art" ou
encore "Les math&eacute;matiques et le marxisme". Remarquable.
</I>
</BLOCKQUOTE>
<LI> Emile Noel "Le matin des mathematiciens" Entretiens sur l'histoire des
math&eacute;matiques sur France Culture, Belin 1985
<BLOCKQUOTE>
<I>
Les entretiens de France Cul enfin disponibles, tr&egrave;s int&eacute;ressant.
</I>
</BLOCKQUOTE>
<LI> "Penser les mat&eacute;matiques" Seuil, collection points science 1982
<BLOCKQUOTE>
<I>
Un poign&eacute;e de math&eacute;maticiens du s&eacute;minaire de philosophie
des math&eacute;matiques de Normale Sup, se d&eacute;cident &agrave; publier
leurs id&eacute;es. Pas toujours facile &agrave; lire, mais contient plein
d'informations sur les math&eacute;matiques contemporaines.
</I>
</BLOCKQUOTE>
<LI> D. Hofstadter "Godel, Escher, Bach" Interedition 1985
<BLOCKQUOTE>
<I>
Sous un aspect attrayant, on d&eacute;couvre les syst&egrave;mes formels et le
th&eacute;or&egrave;me d'incompl&eacute;tude de Godel. La seconde partie sur la
mod&eacute;lisation de l'esprit est moins convaincante. Une initiation agr&eacute;able
&agrave; la logique.
</I>
</BLOCKQUOTE>
<LI> Jean Cavailles "Philosophie math&eacute;matique" Hermann 1962
<LI> Albert Lautmann "Essai sur l'unit&eacute; des math&eacute;matiques et divers
&eacute;crits" 10/18 1977
<BLOCKQUOTE>
<I>
Ces deux ouvrages traitent de l'histoire et de l'&eacute;pist&eacute;mologie
des math&eacute;matiques contemporaines. Pas toujours faciles &agrave; lire
mais plein d'id&eacute;es &agrave; prendre.
</I>
</BLOCKQUOTE>
<LI> J.T. Desanti "La philosophie silencieuse" Seuil 1975
<BLOCKQUOTE>
<I>
L'histoire des fonctions de la variable r&eacute;elle vue par un philosophe
des sciences qui connait bien les math&eacute;matiques.
</I>
</BLOCKQUOTE>
<LI> Henri Poincar&eacute; "La valeur de la science" Flammarion 1970
<LI> Henri Poincar&eacute; "La science et l'hypoth&egrave;se" Flammarion 1968
<LI> Henri Poincar&eacute; "Derni&egrave;res pens&eacute;es" Flammarion 1963
<LI> Henri Poincar&eacute; "Science et m&eacute;thode" Flammarion
<BLOCKQUOTE>
<I>
Les livres du grand math&eacute;maticien sont toujours d'actualit&eacute; et
tr&egrave;s bien &eacute;crits. Le d&eacute;butant appr&eacute;ciera.
</I>
</BLOCKQUOTE>
<LI> A. Dahan-Dalmenico et J. Peiffer "Une histoire des math&eacute;matiques"
Seuil collection points science 1986
<LI> Dedron et Itard "Math&eacute;matiques et math&eacute;maticiens" Magnard 1960
<BLOCKQUOTE>
<I>
Deux livres d'histoire des math&eacute;matiques parmi les meilleurs. Faciles
&agrave; lire
</I>
</BLOCKQUOTE>
<LI> F. Gonseth "Les fondements des math&eacute;matiques, de la g&eacute;om&eacute;trie
d'Euclide &agrave; la relativit&eacute; g&eacute;n&eacute;rale et &agrave;
l'intuitionisme" 1926, r&eacute;&eacute;dition Blanchard 1974.
<LI> F. Gonseth "Les math&eacute;matiques et la r&eacute;alit&eacute;, essai sur
la m&eacute;thode axiomatique" 1936, r&eacute;&eacute;dition Blanchard 1974
<BLOCKQUOTE>
<I>
Dans ces deux livres Ferdinand Gonseth explore comment les math&eacute;matiques
se sont construites et ont &eacute;volu&eacute; &agrave; travers l'histoire
et la n&eacute;cessit&eacute; d'un formalisme dont les d&eacute;fauts sont discut&eacute;s.
</I>
</BLOCKQUOTE>
</UL>
<P>
Les ouvrages suivants vous font p&eacute;n&eacute;trer dans la quatri&egrave;me
dimension et au dela, un voyage &agrave; ne pas manquer
<P>
<UL>
<LI> A. Abbot "Flatland" Denoel 1984
<BLOCKQUOTE>
<I>
Ce livre n'est pas un livre de maths; il est publi&eacute; parmi les romans de
science fiction de la collection Denoel. Ecrit en 1880 il traite de mani&egrave;re
romanc&eacute;e de la vie dans les espaces &agrave; deux dimensions et introduit
les espaces de dimensions sup&eacute;rieurs. Tr&egrave;s facile &agrave; lire,
le nul en maths ne prend aucun risque. Attention cependant ce livre est mysogine.
</I>
</BLOCKQUOTE>
<LI>Rudy Rucker "La quatri&egrave;me dimension" Seuil 1984
<BLOCKQUOTE>
<I>
Bas&eacute; sur le livre pr&eacute;c&eacute;dent cet ouvrage de vulgarisation
aborde en d&eacute;tail tous les aspects de la quatri&egrave;me dimension. Assez
facile.
</I>
</BLOCKQUOTE>
<LI> Thomas Banchoff "La quatri&egrave;me dimension, voyage dans les dimensions
sup&eacute;rieures" Belin 1996
<BLOCKQUOTE>
<I>
Bien illustr&eacute; cet ouvrage donne baucoup de d&eacute;tails sur la
repr&eacute;sentation des objets dans les espaces de dimensions sup&eacute;rieures
&agrave; trois, assez facile.
</I>
</BLOCKQUOTE>
<LI> M. Ghyka "Mystique et philosophie du nombre" Payot
<BLOCKQUOTE>
<I>
L'histoire des nombres vus sous leur aspect mystique. Ce livre contient une
foule de donn&eacute;es sur le sujet, et on y verra des representations de
polytopes en dimensions sup&eacute;rieures &agrave; trois.
</I>
</BLOCKQUOTE>
</UL>
Voici quelques bons ouvrages racontant la vie de math&eacute;maticiens:
<UL>
<LI> Bruno Belhoste "Cauchy un math&eacute;maticien l&eacute;gitimiste au
XIX&egrave;me si&egrave;cle" Belin 1985.
<BLOCKQUOTE>
<I>
La vie du grand math&eacute;maticien en son temps et son oeuvre. On est plong&eacute;
dans la soci&eacute;t&eacute; scientifique du XIX&egrave;me si&egrave;cle;
passionnant.
</I>
</BLOCKQUOTE>
<LI> Hardy "L'apologie d'un math&eacute;maticien" Belin 1985
<BLOCKQUOTE>
<I>
Hardy raconte ses d&eacute;couvertes. Contient aussi de remarquables notes
bibliographiques sur Ramanujan et Bertrand Russell.
</I>
</BLOCKQUOTE>
<LI> V. Voltera, J. Hadamard, P. Langevin, P. Boutroux "Henri Poincar&eacute;,
l'oeuvre scientifique, l'oeuvre philosophique", Librairie Felix Alcan 1914.
<BLOCKQUOTE>
<I>
L'oeuvre du grand math&eacute;maticien vue par les meilleurs savants qui l'ont
connu.
</I>
</BLOCKQUOTE>
</UL>
Les ouvrages suivants sont plus techniques. Ils sont destin&eacute;s &agrave;
faire des math&eacute;matiques ou trouver des d&eacute;monstrations de
th&eacute;or&egrave;mes et divers exercices.
<P>
<UL>
<LI> E. Artin "Alg&egrave;bre g&eacute;om&eacute;trique" Gauthiers-Villars 1972
<BLOCKQUOTE>
<I>
Une vision remarquablement concentr&eacute;e de la g&eacute;om&eacute;trie
&agrave; partir des concept de groupes et de corps, pas tr&egrave;s facile
mais g&eacute;nial.
</I>
</BLOCKQUOTE>
<LI> Efimov "G&eacute;om&eacute;trie sup&eacute;rieure" Edition mir, Moscou 1985
<BLOCKQUOTE>
<I>
Une vision originale de la g&eacute;om&eacute;trie classique avec un d&eacute;veloppement
tr&egrave;s pouss&eacute; de la g&eacute;om&eacute;trie de Lobatchevsky sans
n&eacute;gliger l'aspect contemporain de la question et les applications
&agrave; la physique.
</I>
</BLOCKQUOTE>
<LI> D. Lehmann, R. Bkoucke "Initiation &agrave; la g&eacute;om&eacute;trie" PUF 1988
<BLOCKQUOTE>
<I>
Un bon livre d'initiation qui englobe compl&egrave;tement le sujet allant
jusqu'aux mod&egrave;les projectifs des g&eacute;om&eacute;tries non euclidiennes.
</I>
</BLOCKQUOTE>
<LI> Jean Dhombres "Nombre, mesure et continue. Epist&eacute;mologie et histoire"
CEDIC/Fernand Nathan 1978
<BLOCKQUOTE>
<I>
Un ouvrage remarquable sur l'histoire de la mesure et des nombres de
l'antiquit&eacute; &agrave; nos jours contenant de tr&egrave;s nombreuses
r&eacute;f&eacute;rences et citations. C'est un livre technique contenant
m&ecirc;me un chapitre sur les math&eacute;matiques chinoises.
</I>
</BLOCKQUOTE>
<LI>Jean Dieudonn&eacute; "Alg&egrave;bre lin&eacute;aire et g&eacute;om&eacute;trie
&eacute;l&eacute;mentaire" Hermann 1978
<BLOCKQUOTE>
<I>
Un remarquable condens&eacute; de la g&eacute;om&eacute;trie vue par
la th&eacute;orie des groupes et les invariants associ&eacute;s. Dieudonn&eacute;
accompli l'exploit de faire un livre de g&eacute;om&eacute;trie sans aucune
figure. Moins &eacute;l&eacute;mentaire qu'il le laisse entendre, le d&eacute;butant
devrait &egrave;tre prudent.
</I>
</BLOCKQUOTE>
<LI> Jean Dieudonn&eacute; "Calcul infinit&eacute;simal" Hermann 1968
<BLOCKQUOTE>
<I>
L'analyse math&eacute;matique bien d&eacute;taill&eacute;e. Un classique assez
difficile.
</I>
</BLOCKQUOTE>
<LI> S. Mac Lane, G. Birkhoff "Alg&egrave;bre. Tome 1 structures fondamentales,
tome 2 les grands th&eacute;or&egrave;mes" Gauthier-Villars 1970
<BLOCKQUOTE>
<I>
Un panorama classique et bien structur&eacute; de l'alg&egrave;bre moderne.
Celle-ci est vue &agrave; travers la th&eacute;orie des cat&eacute;gories
qui &eacute;tait &agrave; la mode &agrave; l'&eacute;poque.
</I>
</BLOCKQUOTE>
<LI> Peter J. Hilton "Le langage des cat&eacute;gories" CEDIC 1973
<BLOCKQUOTE>
<I>
Un petit livre tr&egrave;s remarquable d'initiation &agrave; la th&eacute;orie
des cat&eacute;gories qui est un peu pass&eacute;e de mode aujourd'hui.
Agr&eacute;able &agrave; lire.
</I>
</BLOCKQUOTE>
<LI>G. Gleaser "Math&eacute;matiques pour l'&eacute;l&egrave;ve professeur"
Hermann 1971
<BLOCKQUOTE>
<I>
Un foule de concepts math&eacute;matiques tr&egrave;s divers avec beaucoup
d'exemples et de contre-exemples et de conseils pour le futur math&eacute;maticien.
</I>
</BLOCKQUOTE>
<LI>J.P Delahaye "Le fascinant nombre PI" BELIN 1998
<BLOCKQUOTE>
<I>Un livre tr&egrave;s complet sur l'histoire de pi et l' importance
que ce nombre a pris r&eacute;cement. De nombreuses formules, dessins
et algorithmes en font un livre un peu technique mais tr&egrave;s
agr&eacute;able &agrave; lire.</I>
</BLOCKQUOTE>
</UL>
<HR>
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A>Retour
<A HREF="biblio.html"><IMG SRC="../Icones/up.xbm"> </A> D&eacute;but
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
</BODY>
</HTML>
