<HTML>
<HEAD>
<TITLE> Les geometries non euclidiennes suite 3</TITLE>
<META NAME="keywords"
CONTENT="Lobatchewski,Lobatchevski,geom&eacute;trie,g&eacute;om&eacute;trie
non euclidienne,paralleles">
<META NAME="description" CONTENT="Petit expos&eacute; de
g&eacute;om&eacute;trie non euclidienne">
</HEAD>
<BODY bgcolor="#ffffff">
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF="lobatchewskiter.html"><IMG SRC="../Icones/upleft.xbm"> </A> pr&eacute;c&eacute;dent
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
<br>
<a href="../../../www.enst-bretagne.fr/default.htm"><IMG SRC="../Images/ABlogo.gif" border=0></a>
<CENTER>
<H2>Le point de vue moderne.</H2>
<H4>Derni&egrave;re mise &agrave; jour le 29 mai 1996</H4>
</CENTER>
<P>
A la fin du XIX&egrave;me si&egrave;cle, suite aux travaux de Klein et de Riemann
apparaissent les premiers mod&egrave;les de g&eacute;om&eacute;tries non euclidiennes.
<P>
<H3> Le mod&egrave;le de Beltrami</H3>
Le math&eacute;maticien italien
<A HREF="../../../www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Beltrami.html">Beltrami</A> est le premier &agrave; donner un 
mod&egrave;le de g&eacute;om&eacute;trie de Lobatchevsky. Mais comme on le verra
ce mod&egrave;le n'est que local, en &eacute;tudiant la surface &agrave;
courbure constante n&eacute;gative qu'est la pseudo-sph&egrave;re.
<P>
Une pseudosph&egrave;re est une surface &agrave; courbure constante n&eacute;gative
obtenue en faisant tourner une tractrice autour de son asymptote. On peut
visualiser <A NAME="pseudosp"> ici </A> <A HREF="pseudosphere.html"> la
demi pseudosph&egrave;re</A>
<P>
On peut dessiner des triangles &agrave; angles nuls sur une telle surface.
Cependant elle n'est pas un mod&egrave;le complet de la g&eacute;om&eacute;trie
de Lobatchevsky puisqu'en particulier on peut par deux points bien choisis y
faire passer plusieurs g&eacute;od&eacute;siques c'est-&agrave;-dire des droites.
<P>
<A HREF="../../../www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Hilbert.html">Hilbert</A>
d&eacute;montrera plus tard qu'il n'existe pas de surface euclidienne
mod&eacute;lisant compl&egrave;tement la g&eacute;om&eacute;trie de Lobatchevsky.
<P>
<H3> Le mod&egrave;le de Poincar&eacute;</H3>

<A HREF="../../../www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Klein.html">Klein</A>
et <A HREF="../../../www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Poincare.html">Poincar&eacute;</A>
ont donn&eacute; des mod&egrave;les euclidiens de
g&eacute;m&eacute;trie non euclidienne assurant par la l'ind&eacute;pendance du
5&egrave;me postulat d'Euclide et donc son ind&eacute;montrabilit&eacute;.
<P>
Disons quelques mots du mod&egrave;le de Poincar&eacute; en examinant
la figure 11 ci-dessous:
<P>
<IMG ALIGN=middle SRC="../Images/poinc.gif"><I> figure 11</I>
<P>
On y voit un grand cercle not&eacute; om&eacute;ga, ce sera le cercle qui va
enfermer notre espace. Le plan de Lobatchevsky est l'int&eacute;rieur de ce
cercle le cercle non compris. Le cercle joue le r&ocirc;le de l'infini. Tout point
du cercle est &agrave; l'infini. Les droites sont repr&eacute;sent&eacute;es par des
cercles orthogonaux au cercle om&eacute;ga, on les appellera de p-droites
pour la clart&eacute; du discours. Les points sont les points ordinaires.
<P>
On observe deux p-droites parall&egrave;les: (E,D) et (E,A) , deux p-droites
divergentes: (E,D) et (C,B); ainsi qu'un triangle ordinaire (ABC) et un
triangle &agrave; un angle nul (ADE), le point E est &agrave; l'infini.
<P>
Le cercle (C) est un cercle de centre O. Ce dernier est d&eacute;centr&eacute;
pour des raisons que l'on examinera plus loin. Le "cercle" (H) n'est pas un cercle
mais un horocycle, il est tangent au cercle om&eacute;ga.
<P>
Ce mod&egrave; v&eacute;rifie tous les axiomes de la g&eacute;om&eacute;trie euclidienne
sauf celui des parall&egrave;les.
<P>
Bien sur dans un tel mod&egrave;le c'est la m&eacute;trique qui est modifi&eacute;e.
Contrairement aux apparences les droites ont bien une longueur infinie car
la m&eacute;trique n'y est pas euclidienne. Poincar&eacute; d&eacute;crit tr&egrave;s
bien dans "La science et l'hypoth&egrave;se" comment on vit dans un tel
espace. L'id&eacute;e est que l'on devient de plus en plus petit en s'approchant
du cercle om&eacute;ga de tel sorte qu'on ne puisse jamais l'atteindre.
<P>
De mani&egrave;re plus p&eacute;cise la distance des points A et B sur la
p-droite est donn&eacute;e par la formule:
<P>
<BLOCKQUOTE>
d(A,B) = 1/2|log(A',B',A,B)|
</BLOCKQUOTE>
O&ugrave; A' et B' sont les points d'intersection de la p-droite (AB) avec le
cercle om&eacute;ga et n'appartiennent pas &agrave; l'espace, et
(A',B',A,B) le birapport des quatre points. Cette formule repr&eacute;sente
bien une distance, et elle assure la mesure infinie des p-droites. Elle
explique pourquoi le centre O du cercle (C) apparait d&eacute;centr&eacute;
alors qu'il est bien au centre mais pour la distance d qui n'est plus euclidienne.
<P>
Il existe bien d'autres mod&egrave;les d'une telle g&eacute;om&eacute;trie
dont nous n'avons pas parl&eacute; comme le mod&egrave;le de Klein ou le
mod&egrave;le &agrave; hyperboles.
<P>
Il existe un <A HREF="../../../www.geom.umn.edu/docs/forum/hype/hype.html">programme</A>
tournant sur macintosh qui permet de bien se familiariser avec le mod&egrave;le de
poincar&eacute;.
<P>
<H3> <A NAME="cont">Le point de vue contemporain (prochainement)</A></H3>
Les g&eacute;om&eacute;tries euclidiennes sont maintenant unifi&eacute;es
&agrave; travers la g&eacute;om&eacute;trie projective o&ugrave;
l'int&eacute;rieur
d'une quadrique peut &egrave;tre munie d'une structure de g&eacute;om&eacute;trie de
Lobatchevsky si elle est r&eacute;elle, de g&eacute;om&eacute;trie de Riemann
si elle est imaginaire ou de g&eacute;om&eacute;trie euclidienne si elle
est d&eacute;g&eacute;n&eacute;r&eacute;e. Nous aborderons ce point plus en d&eacute;tail
ulterieurement d&egrave;s que l'on d&eacute;gagera un peu de temps pour y travailler.
En attendant la bibliographie ci-dessous donne de nombreuses informations
int&eacute;ressantes.
<H3><A NAME="#biblio"> Bibliographie</A></H3>
<H4> 
<UL>
<LI> F. Peyrard "Les &eacute;l&eacute;ments d'Euclide" 1809, r&eacute;&eacute;dition
Blanchard.
<P>
<LI>Efimov "G&eacute;om&eacute;trie sup&eacute;rieure" Edition mir, Moscou 1985
<P>
<LI>F. Gonseth "Les fondements des math&eacute;matiques, de la g&eacute;om&eacute;trie
d'Euclide &agrave; la relativit&eacute; g&eacute;n&eacute;rale et &agrave;
l'intuitionisme" 1926, r&eacute;&eacute;dition Blanchard 1974.
<P>
<LI>F. Gonseth "La g&eacute;om&eacute;trie et le probl&egrave;me de l'espace"
Tome V les g&eacute;om&eacute;tries non euclidiennes, Dunod 1952
<P>
<LI>Lobachewsky "G&eacute;om&eacute;trie imaginaire" Journal de Crelle Bd XVII 1837
<P>
<LI>A. Tresse "Th&eacute;orie &eacute;l&eacute;mentaire des g&eacute;om&eacute;tries
non euclidiennes" Gauthiers-Villars 1957
<P>
<LI>Barbarin "La g&eacute;om&eacute;trie non euclidienne" 1928, r&eacute;&eacute;dition
Jacques Gabay
<P>
<LI>Coxeter "Non euclidean Geometry" The university of Toronto Press
<P>
<LI> Marcel Berger "G&eacute;om&eacute;trie, tome 5: la sph&egrave;re pour elle
m&ecirc;me, g&eacute;om&eacute;trie hyperbolique, l'espace des sph&egrave;res"
CEDIC/Fernand Nathan 1977.<p>
<li>George E. Martin "The foundation of Geometry and The
    Non Euclidean Plane", Springer Verlag 1975.<p>
<li>Richard S. Millman and George D. Parker "Geometry, A
    Metric Approach with Models", Springer Verlag 1993.

</UL>

<HR>
<A HREF=index.html><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF=lobatchewskiquat.html><IMG SRC="../Icones/up.xbm"> </A> d&eacute;but
<A HREF=lobatchewskiter.html><IMG SRC="../Icones/upleft.xbm"> </A> pr&eacute;c&eacute;dent
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF=../index.html><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
</BODY>
</HTML>
