<HTML>
<HEAD>
<TITLE> Les geometries non euclidiennes suite 1</TITLE>
<META NAME="keywords"
CONTENT="Lobatchewski,Lobatchevski,geom&eacute;trie,g&eacute;om&eacute;trie
non euclidienne,paralleles">
<META NAME="description" CONTENT="Petit expos&eacute; de
g&eacute;om&eacute;trie non euclidienne">
</HEAD>
<BODY bgcolor="#ffffff">
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF="lobatchewski.html"><IMG SRC="../Icones/upleft.xbm"> </A> pr&eacute;c&eacute;dent
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
<br>
<a href="../../../www.enst-bretagne.fr/default.htm"><IMG SRC="../Images/ABlogo.gif" border=0></a>
<CENTER>
<H2>Les travaux de <A HREF="../../../www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Lobachevsky.html">Lobatchevsky</A></H2>
</CENTER>
<P>
Lobatchevsky est all&eacute; tr&egrave;s loin dans la construction de la nouvelle
g&eacute;om&eacute;trie avec la conviction que cette g&eacute;om&eacute;trie
est parfaitement coh&eacute;rente et autonome. Il faudrait parler du Hongrois
J. Bolay, contemporain de Lobatchevsky, qui a ind&eacute;pendant &eacute;labor&eacute;
une g&eacute;om&eacute;trie analogue, mais ce dernier n'a publi&eacute; qu'un petit
opuscule en latin de ses travaux alors que Lobatchevsky a beaucoup publi&eacute;
en russe allemand et fran&ccedil;ais et a d&eacute;montr&eacute; ses
r&eacute;sultats plusieurs fois sous des formes diff&eacute;rentes afin de
convaincre ses contemporains avec difficult&eacute;. Il ne faut pas non plus
oublier le grand Gauss, qui le premier, d&egrave;s 1795 selon lui, &eacute;tait
convaincu de l'existence math&eacute;matique des g&eacute;om&eacute;tries non
euclidienne. Malheureusement il n'a rien publi&eacute; la dessus et n'en
parle que dans sa correspondance.
<P>
<H3> La g&eacute;om&eacute;trie de Lobatchevsky</H3>
Nous allons donc partir de l'hypoth&egrave;se que la somme des angles d'un
triangle est inf&eacute;rieure &agrave; deux angles droits. Cela revient,
comme on l'a examin&eacute; plus haut, &agrave; abandonner l'unicit&eacute;
de la parall&egrave;le &agrave; une droite passant par un point donn&eacute;.
<P>
<A NAME="retfig3">examinons la <I>figure 3</I> ci-dessous.</A>
<P>
<IMG ALIGN="middle" SRC="../Images/Lob3.gif"> <I><b>Figure 3</b></I>
<P>
Nous avons une droite <b>D</b>, un point <b>B</b> ext&eacute;rieur et la
perpendiculaire <b>BP</b> &agrave; la droite <b>D</b>. Les triangles
<b>(PBP1), (PBP2), ...., (PBPn)</b> ont tous la sommes de leurs angles inf&eacute;rieure
&agrave; 180 degr&eacute;s. Faisons tendre le point <b>Pn</b> vers l'infini
sur la droite <b>D</b>, l'angle <b>BPnP</b> tend vers z&eacute;ro et la droite
<b>BPn</b> tend vers la droite limite <b>L1</b>. L'angle fait par les deux
droites <b>BP</b> et <b>L1</b> est strictement inf&eacute;rieure &agrave; 90 degr&eacute;s.
La droite <b>L1</b> est une parall&egrave;le &agrave; <b>D</b>. Par sym&eacute;trie
de la figure la droite <b>L2</b> est aussi une parall&egrave;le &agrave; <b>D</b>.
La doite <b>H</b> comprise entre les deux l'est &eacute;galement. On verra plus
loin l'explication de cette d&eacute;nomination. Avec ces d&eacute;finitions
il y deux parall&egrave;les &agrave; une droite et si on se limite &agrave une
direction il n'y a plus qu'une seule parall&egrave;le &agrave; une droite au
sens de Lobatchevsky.
<P>
Lobatchevsky appelle <I><b>parall&egrave;le</b></I> les droites <b>L1</b> et <b>L2</b>
et <I><b>divergente</b></I> les droites de type <b>H</b>. On verra plus loin
le pourquoi de ces d&eacute;finitions.
<P>
Ainsi avec ces d&eacute;finitions, si on se limite &agrave; une direction il
n'y a qu'une seule parall&egrave;le a une droite passant par un point donn&eacute;
en analogie avec la g&eacute;om&eacute;trie classique et on montre de plus
le r&eacute;sultat suivant:
<BLOCKQUOTE>
<EM>
Le parall&eacute;lisme au sens de Lobatchevsky est une relation d'&eacute;quivalence comme en g&eacute;om&eacute;trie
euclidienne.
</EM>
</BLOCKQUOTE>
<P>
En examinant &agrave; nouveau la figure 3 le triangle form&eacute; par le cot&eacute;
<b>BP</b> et les droites <b>D</b> et <b>L2</b> est un triangle &agrave; un angle
nul, appel&eacute; par Lobatchevsky <I> triangle impropre</I>. Si le point
<b>B</b> se rapproche de <b>P</b> on obtiendra un triangle impropre compris dans
le pr&eacute;cedent et dont le d&eacute;ficit est plus petit. L'angle <b>a'</b>
qui est l'angle limite (angle de parall&eacute;lisme associ&eacute; &agrave;
<b>B</b> et &agrave; <b>D</b>) n'est pas constant. Cet angle est &eacute;troitement
associ&eacute; &agrave; la distance BP not&eacute;e <b>a</b>. Lobatchevsky
montre qu'il est inversement proportionnel &agrave; cette distance et qu'il
varie de 90 degr&eacute;s &agrave; 0 quand <b>a</b> varie de 0 &agrave; l'infini.
<P>
Consid&eacute;rons maintenant la <I> figure 4 </I> ci-dessous
<P>
<IMG ALIGN=middle SRC="../Images/Lob4.gif"> <I><b>Figure 4</b></I>
<P>
o&ugrave; nous avons <b>AA'</b> et <b>BB'</b> perpendiculaires &agrave; une droite.
A cause du d&eacute;ficit dans les triangles, le plus grand triangle ayant
le plus grand d&eacute;ficit, l'angle <b>OA'A</b> est sup&eacute;rieur
&agrave; l'angle <b>OB'B</b>, de plus si on suppose <b>OA = AB</b>, on montre
qu'on a <b>OA' < A'B'</b> et <b>OA/OA'  < OB/OB' </b> contrairement &agrave;
la g&eacute;om&eacute;trie euclidienne o&ugrave; on a l'&eacute;galit&eacute;.
Le th&eacute;or&egrave;me de Thal&egrave;s est faux, et les relations trigonom&eacute;triques
classsiques n'ont plus des sens ici. Il va falloir recr&eacute;er une nouvelle
trigonom&eacute;trie, nous verrons cela plus loin.
<P>
Nous pouvons examiner ce que devient le th&eacute;or&egrave;me de Pythagore
avec ce type d'in&eacute;galit&eacute;. On montre ais&eacute;ment la formule
suivante:
<BR><BR>
<CENTER>
<table border>
<tr><td>OA'^2 > OA^2 + AA'^2</td></tr>
</table>
</CENTER>
<BR>
Nous verrons plus loin la nouvelle formule exacte
<P>
Ensuite Lobatchevsky montre divers r&eacute;sultats que nous allons passer
en revue rapidement.<BR>
Soit une perpendiculaire commune &agrave; deux droites comme sur la figure 5
<P>
<IMG ALIGN="middle" SRC="../Images/Lob5.gif"> <I><b>Figure 5</b></I>
<P>
Sur cette figure soient les droites <b>D1</b>et <b>D2</b> qui ont comme
perpendiculaire commune la droite <b>AB</b>, soient de plus <b>CE </b>
et <b>GF </b> deux autres perpendiculaires &agrave; la droite <b>D1 </b>.
Les angles <b>BEC </b>et <b> BFG</b> sont aigus car la somme des angles
d'un quadrilat&egrave;re est inf&eacute;rieure &agrave; 360 degr&eacute;s et
les trois autres faisant 90 degr&eacute;s par construction. Le point H est le
pied de la perpendiculaire abaiss&eacute;e de B sur la droite CE. BH coupe
GF au point I. Du point F abaissons la perpendiculaire <b>FI</b> sur la droite
BH qui coupe GF en J (le cercle sur la droite de la figure repr&eacute;sente
un agrandissement de ce qui se passe autour du point <b>F</b>).
 Nous avons par construction la relation suivante sur les 
longueurs: FI < FJ et donc BF/BE < GI/FH < GJ/FH d'ou le r&eacute;sultat:
GJ > (BF.EH)/BE<BR>
Le point <b>E</b> &eacute;tant fix&eacute; quand F s'&eacute;loigne vers l'infini
sur <b>D2</b> la longueur BG croit ind&eacute;finiment ainsi que la longueur
FJ, d'ou ce r&eacute;sultat surprenant en g&eacute;om&eacute;trie non euclidienne:
<P>
<CENTER>
<b>
<table border>
<tr><th> 4&egrave;me r&eacute;sultat en g&eacute;om&eacute;trie de Lobatchevsky</th></tr>
<tr><td align=center> Deux droites du plan ayant une perpendiculaire commune s'&eacute;cartent
ind&eacute;finiment lorsque l'on s'&eacute;loigne de la perpendiculaire commune
et cette perpendiculaire commune et la plus courte distance entre ces droites.</td></tr>
</table>
</b>
</CENTER>
<P>
On en d&eacute;duit ensuite que les parall&egrave;les (au send d&eacute;finit
plus haut) se rapprochent asymptotiquement dans le sens du parall&eacute;lisme
et s'en &eacute;loigne ind&eacute;finiment dans l'autre sens.<BR>
On comprend mieux maintenant le vocabulaire de Lobatchevsky et pourquoi
les droites <b>H</b> de la <A HREF="#retfig3">figure 3</A> sont appel&eacute;es
divergentes et sont bien distinctes des deux droites limites appel&eacute;es, elles,
parall&egrave;les.
<P>
Voyons maintenant quelques autres r&eacute;sultats de cette g&eacute;om&eacute;trie
sans d&eacute;tailler les d&eacute;monstrations que l'on trouvera dans .......
<BR>
En particulier on a la propri&eacute;t&eacute; suivante qui est aussi vraie
en g&eacute;om&eacute;trie euclidienne et qui conforta Lobatchevsky dans
la justesse de ses d&eacute;finitions:<BR>
<BLOCKQUOTE>
<EM>
Si deux droites sont parall&egrave;les alors l'intersection des plans qui les
contiennent, quand elle existe, est une droite parall&egrave;le aux deux autres.
</EM>
</BLOCKQUOTE>
<P>
La g&eacute;om&eacute;trie dans l'espace est utilis&eacute;e pour obtenir
des r&eacute;sultats de g&eacute;om&eacute;trie plane et en particulier la
valeur de l'angle de parall&eacute;lisme. Mais d'abord un resultat fondamental
pour la suite de l'expos&eacute;:
<P>
<CENTER>
<b>
<table border>
<tr><th> 5&egrave;me r&eacute;sultat en g&eacute;om&eacute;trie de 
Lobatchevsky(fondamental)</th></tr>
<tr><td align=center> Si trois plans se coupent suivant trois parall&egrave;les
alors la somme de leurs angles di&egrave;dres est &eacute;gale &agrave;
180 degr&eacute;s.</td></tr>
</table>
</b>
</CENTER>
<P>
Ce r&eacute;sultat est fondamental car il va permettre le calcul de l'angle
limite et toute la trigronom&eacute;trie associ&eacute;e.
<P>
Consid&eacute;rons maintenant un triangle dont deux m&eacute;diatrices sont
parall&egrave;les (figure 6). Alors on montre dans ce cas que la troisi&egrave;me
m&eacute;diatrice est aussi parall&egrave;le aux deux autres.
<P>
<IMG ALIGN="middle" SRC="../Images/Lob6.gif"> <I><b>Figure 6</b></I>
<P>
En g&eacute;om&eacute;trie euclidienne on obtient dans ce cas un triangle
d&eacute;g&eacute;n&eacute;r&eacute; o&ugrave; les trois cot&eacute;s sont
align&eacute;s. Mais en g&eacute;om&eacute;trie de Lobatchevsky il en est
autrement; en effet si les trois sommets du triangle &eacute;taient align&eacute;s
les m&eacute;diatrices auraient une perpendiculaire commune et elles ne seraient
pas parall&egrave;les mais divergentes d'apr&egrave;s ce qu'on a vu plus haut.
Ainsi on a les trois cot&eacute;s de ce triangle qui sont sur un cercle
dont le centre est &agrave; l'infini. Ce cercle bizarre n'est pas une droite
mais une courbe particuli&egrave;re qu'on appelle <I><b>horocycle</b></I>.
Cette courbe joue un r&ocirc;le particulier dans cette g&eacute;om&eacute;trie. On
peut la pr&eacute;senter comme une courbe coupant orthogonalement un faisceau
de parall&egrave;les. Chaque droite du faisceau est un axe de sym&eacute;trie
pour l'horocycle. Si nous faisons tourner un horocycle autour d'un de ses axes
de sym&eacute;trie dans l'espace, nous obtenons une surface de r&eacute;volution
qu'on appelle une <I><b>horosph&egrave;re</b></I>. On peut en voir un
&eacute;chantillon sur la figure 7.
<P>
<CENTER>
<IMG SRC="../Images/Lob7.gif">
<BR>
<I><b>Figure 7</b></I>
</CENTER>
<P>
On y voit trois parall&egrave;les du faisceau la coupant en trois points
<b>A, B</b> et <b>C</b>. Les trois plans contenant les trois droites du
faisceau coupent cette horosph&egrave;re suivant les trois courbes
<I>horosph&eacute;riques</I> <b>AB, AC, BC</I>. Ces trois courbes forment
un triangle sur l'horosph&egrave;re etla somme des angles de ce triangle
est &eacute;agle &agrave; la somme des angles du tri&egrave;dre form&eacute;
par les trois plans. Comme nous avons
vu que la somme des angles d'un tel tri&egrave;dre est &eacute;gale &agrave;
180 degr&eacute;s, on d&eacute;duit le r&eacute;sultat suivant:
<P>
<CENTER>
<b>
<table border>
<tr><th> 6&egrave;me r&eacute;sultat en g&eacute;om&eacute;trie de 
Lobatchevsky(fondamental)</th></tr>
<tr><td align=center> La surface de l'horosph&egrave;re est r&eacute;gie par
la g&eacute;om&eacute;trie euclidienne.</td></tr>
</table>
</b>
</CENTER>
<P>
On obtient ainsi le premier mod&egrave;le non euclidien de g&eacute;om&eacute;trie
euclidienne.
<P>
L'horocycle et l'horosph&egrave;re sont des objets nouveaux et &eacute;tranges
de cette g&eacute;om&eacute;trie qui non pas d'&eacute;quivalent en g&eacute;om&eacute;trie
euclidienne. Il existe aussi une autre figure nouvelle qui est la courbe
&eacute;quidistante d'une droite donn&eacute;e. L'ensemble des points situ&eacute;s
&agrave; &eacute;gale distance d'une droite, est une droite parall&egrave;le
en g&eacute;om&eacute;trie euclidienne, mais en g&eacute;om&eacute;trie de
Lobatchevsky il en est autrement. En effet on a vu que les parall&egrave;les
sont asymptotiques l'une de l'autre dans une direction et que les divergentes
n'ont qu'une perpendiculaire commune et s'&eacute;loignent indfiniment dans les
deux directions. Il ne peut donc s'agire que d'une courbe qu'on apelle
hypercycle. Si on fait tourner cette courbe autour d'une de ses perpendiculaires
on obtien une surface appel&eacute; hypersph&egrave;re. On montre facilement
que la g&eacute;om&eacute;trie de cette surface est la g&eacute;om&eacute;trie
de Lobatchevsky.
<P>
L'horocycle et l'horosph&egrave;re vont jouer un r&ocirc;le important dans
la suite de l'expos&eacute; on peut en effet les consid&eacute;rer comme les
objets <I>euclidiens</I> de cette g&eacute;om&eacute;trie et les utiliser pour
d&eacute;velopper la mesure des longueurs, aires et volumes ainsi que la
nouvelle trigonom&eacute;trie associ&eacute; &agrave; cet espace. C'est
l'objet du chapitre suivant.
<P>
<H2>
<CENTER>
<A HREF="lobatchewskiter.html">La g&eacute;om&eacute;trie non euclidienne
analytique</A>.
</CENTER>
</H2>
<HR>
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF="lobatchewskibis.html"><IMG SRC="../Icones/up.xbm"> </A> d&eacute;but
<A HREF="lobatchewski.html"><IMG SRC="../Icones/upleft.xbm"> </A> pr&eacute;c&eacute;dent
<A HREF="lobatchewskiter.html"><IMG SRC="../Icones/downright.xbm"> </A> suivant
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
</BODY>
</HTML>
