<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
<!--Converted with LaTeX2HTML 96.1 (Feb 5, 1996) by Nikos Drakos (nikos@cbl.leeds.ac.uk), CBLU, University of Leeds -->
<HTML>
<HEAD>
<TITLE>Introduction</TITLE>
<META NAME="description" CONTENT="Introduction">
<META NAME="keywords" CONTENT="zeta">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
</HEAD>
<BODY LANG="EN" bgcolor="#ffffff">
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
<br>
<a href="../../../www.enst-bretagne.fr/default.htm"><IMG SRC="../Images/ABlogo.gif" border=0></a>
<CENTER>
<H3>
<b>
1+2+3+4+...... = -1/12 (si si)<BR>
Derni&egrave;re mise &agrave; jour le 29 mai 1996
</H3>
<P>
<H4>
Il existe une <A HREF="../Latex/zeta.tex">version latex</A> de cet expos&eacute;.
</b>
</H4>
</CENTER>
<BR> <P>
<H1><A NAME="SECTION00010000000000000000">Introduction</A></H1>
<P>
Dans le num&#233;ro de juillet-ao&#251;t 1989 de la revue <EM>Ciel et Espace</EM> le
physicien Jean THIERRY-MIEG, dans un article intitul&#233; <EM>&quot;La recherche
de la th&#233;orie unifi&#233;e de l'univers: fin de la physique ou
physique sans fin&quot;</EM> o&#249; il oppose la conception sur l'unification des
forces en physique du prix nobel Glashow a celle de Hawking, &#233;crit:
<BLOCKQUOTE> <EM>
&quot; Ainsi il (Hawking) se pr&#233;occupe peu de la renormalisation des infinis,
difficult&#233; technique inh&#233;rente &#224; la th&#233;orie des champs,
dont le premier inventeur fut Riemann, le grand math&#233;maticien du si&#232;cle
pass&#233;. Celui-ci d&#233;couvrit que la somme des entiers (0+1+2+3+...)
jusqu'&#224; l'infini vaut -1/12. Ce curieux r&#233;sultat fut
red&#233;couvert quelques ann&#233;es plus tard par un jeune autodidacte
indou, Ramanujan.&quot;
</EM>
</BLOCKQUOTE>
C'est assez surprenant comme remarque d'autant plus que la suite de l'article
n'&#233;claire pas tellement plus le lecteur non math&#233;maticien sur cette curieuse
formule.<BR>
<P>
L'explication provient des travaux de Riemann concernant l'&#233;tude des fonctions
analytiques et plus particuli&#232;rement la c&#233;l&#232;bre fonction <EM>z&#233;ta</EM> qu'il
a longuement &#233;tudi&#233;e.
<BR> <P>
<H1><A NAME="SECTION00020000000000000000">Les fonctions analytiques</A></H1>
<P>
Rappelons bri&#232;vement ce que sont les fonctions analytiques. Il y a plusieurs
d&#233;finitions &#233;quivalentes des fonctions analytiques dans le plan complexe. Ces
d&#233;finitions ne sont pas &#233;quivalentes si on se limite &#224; l'ensemble des r&#233;els.
Donnons cette d&#233;finition classique:
<BLOCKQUOTE> <EM>Une fonction complexe d&#233;finie sur un ouvert D du plan complexe est dite analytique
(ou holomorphe) dans D si pour tout point <IMG WIDTH=12 HEIGHT=14 ALIGN=MIDDLE ALT="tex2html_wrap_inline111" SRC="Zeta/img1.gif"  >
de D il existe un disque ouvert  <IMG WIDTH=105 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline113" SRC="Zeta/img2.gif"  >
contenu dans D et tel que l'on ait</EM>
<P> <IMG WIDTH=327 HEIGHT=44 ALIGN=BOTTOM ALT="displaymath105" SRC="Zeta/img3.gif"  > <P>
<P>
<EM> <IMG WIDTH=13 HEIGHT=14 ALIGN=MIDDLE ALT="tex2html_wrap_inline115" SRC="Zeta/img4.gif"  >  est une suite de nombres complexes et le second membre est une s&#233;rie
enti&#232;re convergente dans  <IMG WIDTH=12 HEIGHT=11 ALIGN=BOTTOM ALT="tex2html_wrap_inline117" SRC="Zeta/img5.gif"  > .</EM>
</BLOCKQUOTE>
Autrement dit une fonction est analytique si elle d&#233;veloppable en s&#233;rie enti&#232;re dans
son domaine de d&#233;finition, et la s&#233;rie coincide avec sa s&#233;rie de Taylor et la fonction
analytique est ainsi somme de sa s&#233;rie de Taylor.<BR>
<P>
Les fonctions analytiques jouissent de propri&#233;t&#233;s remarquables dans le plan complexe.
Sur l'ensemble des r&#233;els ces propri&#233;t&#233;s sont tr&#232;s diff&#233;rentes et &#224; vrai dire
peu int&#233;ressantes ce qui fait que leur &#233;tude s'est d&#233;velopp&#233;e sur l'ensemble des
complexes.<BR>
<P>
Une des propri&#233;t&#233;s remarquables des fonctions analytiques dans le plan complexe est
le principe du <EM>prolongement analytique</EM>. Une fonction analytique est une fonction
<EM>brid&#233;e</EM> en ce sens qu'il n'est pas possible de la modifier au voisinage d'un point
sans r&#233;percuter la modification sur la fonction toute enti&#232;re, si on fait en sorte de
la conserver analytique. De mani&#232;re plus pr&#233;cise si deux fonctions analytiques <I>f</I> et <I>g</I>
d&#233;finie sur un domaine D ouvert connexe coincident dans un voisinage ouvert arbitrairement
petit d'un point, alors elles coincident sur le domaine D tout entier.<BR> 
Il peut arriver d'avoir des fonctions analytiques d&#233;finies sur des domaines diff&#233;rents
est coincidantes sur une partie commune des domaines. On peut alors d&#233;finir une fonction
plus <EM>grande</EM> d&#233;finie sur l'union des domaine. On prolonge ainsi une fonction et
ce de mani&#232;re unique.<BR>
<P>
Par exemple la fameuse s&#233;rie
<P> <IMG WIDTH=296 HEIGHT=44 ALIGN=BOTTOM ALT="displaymath106" SRC="Zeta/img6.gif"  > <P>
<P>
est convergente dans l'intervalle  ]-1,+1[ de l'ensemble des nombres r&#233;els
et a pour somme:
<P>
<P> <IMG WIDTH=295 HEIGHT=33 ALIGN=BOTTOM ALT="displaymath107" SRC="Zeta/img7.gif"  > <P>
<P>
En dehors de cet intervalle elle diverge. La fonction <I>g</I> est, elle,
d&#233;finie sur un domaine plus large: <IMG WIDTH=54 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline127" SRC="Zeta/img8.gif"  > .
<BR>
<P>
La fonction <I>f</I> est repr&#233;sent&#233;e par la portion d'hyperbole de <I>g</I> dans
l'intervalle  ]-1,+1[, en dehors de cet intervalle elle n'est pas d&#233;finie
est peut &#234;tre prolong&#233;e d'une infinit&#233; de mani&#232;re, dont la plus naturelle
est la fonction <I>g</I>.<BR>
<P>
Sur le plan complexe il n'y a qu'une mani&#232;re de prolonger <I>f</I>, c'est la fonction <I>g</I>.
On peut ainsi attribuer &#224; <I>f</I> les valeurs de <I>g</I> aux points ou <I>f</I> n'est pas d&#233;finie.
C'est ce que fait un peu cavali&#232;rement Jean THIERRY-MIEG mais pour la fonction
z&#233;ta de Riemann.
<BR> <P>
<H1><A NAME="SECTION00030000000000000000">La fonction z&#233;ta</A></H1>
<P>
Riemann a longuement &#233;tudi&#233; la fonction suivante appel&#233;e fonction z&#233;ta:
<P> <IMG WIDTH=297 HEIGHT=44 ALIGN=BOTTOM ALT="displaymath147" SRC="Zeta/img9.gif"  > <P>
<P>
Si on se limite &#224; l'ensemble des nombres r&#233;els cette s&#233;rie est convergente pour
<I>z</I> &gt; 1 est divergente sinon. <BR>
<P>
On a r&#233;ussi &#224; sommer cette s&#233;rie pour les valeurs paires de <I>z</I>. Par exemple
<P> <IMG WIDTH=293 HEIGHT=44 ALIGN=BOTTOM ALT="displaymath148" SRC="Zeta/img10.gif"  > <P>
<P>
et de mani&#232;re plus f&#233;n&#233;rale:
<P> <IMG WIDTH=321 HEIGHT=44 ALIGN=BOTTOM ALT="displaymath149" SRC="Zeta/img11.gif"  > <P>
<P>
o&#249; les  <IMG WIDTH=17 HEIGHT=22 ALIGN=MIDDLE ALT="tex2html_wrap_inline167" SRC="Zeta/img12.gif"  >  sont les nombres de Bernoulli:
<IMG WIDTH=62 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline169" SRC="Zeta/img13.gif"  >  ,
<IMG WIDTH=71 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline171" SRC="Zeta/img14.gif"  > 
etc...
Il se trouve que la fonction z&#233;ta de Riemann a dans le plan complexe plusieurs
prolongements analytiques d&#233;finis sur le plan auquel on a enlev&#233; le point (1,0).
En fait quand on dit plusieurs, c'est dans la formulation car les valeurs pour ces prolongements
sont bien &#233;videmment les m&#234;mes; comme par exemple:
<P> <IMG WIDTH=341 HEIGHT=39 ALIGN=BOTTOM ALT="displaymath150" SRC="Zeta/img15.gif"  > <P>
<P>
avec
<P>
<P> <IMG WIDTH=324 HEIGHT=38 ALIGN=BOTTOM ALT="displaymath151" SRC="Zeta/img16.gif"  > <P>
<P>
Cette fonction  <IMG WIDTH=8 HEIGHT=11 ALIGN=BOTTOM ALT="tex2html_wrap_inline173" SRC="Zeta/img17.gif"  >  v&#233;rifie la relation suivante:
<P>
<P> <IMG WIDTH=296 HEIGHT=16 ALIGN=BOTTOM ALT="displaymath152" SRC="Zeta/img18.gif"  > <P>
<P>
pour <I>n</I> entier positif, c'est la fameuse fonction d'Euler.
<P>
On montre que la fonction  <IMG WIDTH=8 HEIGHT=22 ALIGN=MIDDLE ALT="tex2html_wrap_inline177" SRC="Zeta/img19.gif"  >
v&#233;rifie aussi l'&#233;quation fonctionnelle
suivante pour <I>z</I> prenant ses valeurs dans  <IMG WIDTH=151 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline181" SRC="Zeta/img20.gif"  > :<BR> 
<P> <IMG WIDTH=361 HEIGHT=28 ALIGN=BOTTOM ALT="displaymath153" SRC="Zeta/img21.gif"  > <P>
<P>
C'est cette &#233;quation fonctionnelle qui va nous servir pour &#233;valuer  <IMG WIDTH=40 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline183" SRC="Zeta/img22.gif"  > .
En effet si dans le premier membre on pose <I>z</I> = 2 on obtient
<IMG WIDTH=40 HEIGHT=24 ALIGN=MIDDLE ALT="tex2html_wrap_inline183" SRC="Zeta/img22.gif"  >  et dans le second membre<BR>
<P>
<P> <IMG WIDTH=418 HEIGHT=36 ALIGN=BOTTOM ALT="displaymath154" SRC="Zeta/img23.gif"  > <P>
<P>
ce qui correspond bien &#224; la valeur annonc&#233;e.
<P>

<H1><A NAME="SECTION00040000000000000000">conclusion</A></H1>
<P>
Pour en revenir &#224; l'article de d&#233;part, il aurait &#233;t&#233; plus rigoureux de
dire que Riemman a trouv&#233; un prolongement analytique &#224; la fonction
zeta qui vaut -1/12 pour la valeur -1 de la variable o&#249; ce
prolongement est d&#233;fini, mais cela perd de son impact et a l'inconv&#233;nient
de prendre le lecteur pour un savant, alors les raccourcis qui en mettent
plein la vue s'imposent.
<BR> <HR>
<H1><A NAME="SECTION00050000000000000000">bibliographie</A></H1>
<P>
<UL><LI> Murray R. Spiegel<BR> 
Variable complexe, cours et probl&#232;mes. S&#233;rie Schaum<LI> Pennisi, Gordon<BR> 
Element of complex variables. Holt, Ronehart and Winston<LI> Fran&#231;ois Bayen, Christian Margaria<BR> 
Fonction d'une variable complexe. Tome 1 p 266.
</UL><BR> <HR>
<A HREF="index.html"><IMG SRC="../Icones/back.xbm"> </A> Retour
<A HREF="zeta.html"><IMG SRC="../Icones/up.xbm"> </A> D&eacute;but
<A HREF="plan.html"><IMG SRC="../Icones/plan.xbm"> </A>Plan
<A HREF="../index.html"><IMG SRC="../Icones/home.gif"> </A> Home Andr&eacute; Brouty
</BODY>
</HTML>
